accent
accepted
access
accessor
account
accuracy
ack
action
active
actual
adaptive
add
advance
affected
after
again
aggregate
agreement
alias
aliased
align
alignment
all
aloud
amber
and
animation
anon
anonymous
answer
answered
answers
any
api
app
appended
apply
artifacts
ask
assess
assessment
assessor
asset
assignment
assignments
async
attached
attempt
attempted
attempts
audio
auth
authenticate
auto
available
average
award
awarded
back
backend
background
badge
badges
banner
bar
base
begin
best
between
binding
bits
blank
blanks
body
bold
bool
border
bottom
bounded
box
bubble
bucket
budget
build
bundle
bundled
busy
button
buttons
cache
cached
calculate
calendar
callback
can
cancel
cancelled
candidate
candidates
canonical
card
cards
case
cause
cefr
ceiling
change
changed
changes
channels
char
chars
chat
cheat
check
checksum
child
children
chip
choice
chunk
class
classifier
classify
cleanup
clear
client
cloud
cloze
code
coherence
collect
color
colors
column
columns
commit
committed
committing
common
companion
complete
completed
completing
completion
component
components
comprehension
concentric
concept
confidence
config
configured
confirm
conflict
connection
connectivity
const
constants
consumer
contains
content
context
contextual
continue
contract
controller
controllers
conversation
conversations
convert
coordinator
coordinators
copy
core
correct
correction
corrections
count
coverage
create
created
credentials
criteria
crypto
current
curriculum
cursor
custom
czech
czechify
daily
dao
daos
dark
dart
data
database
date
day
days
dead
deck
declension
decode
default
delay
delayed
delete
delta
depth
description
destinations
detail
details
device
diacritic
diacritics
diagnostic
diagnostics
dialogue
dictation
did
different
difficulty
dio
dir
direction
display
dispose
divider
domain
done
dot
double
draft
drift
due
duration
dynamic
earn
earned
ease
easy
edge
edit
editing
elev
email
emoji
empty
enabled
end
engine
engines
enqueue
enrich
ensure
entities
entity
enums
error
errors
estimate
estimates
eval
evaluate
evaluating
evaluation
event
events
evidence
exam
example
examples
exams
exception
exceptions
exercise
exercises
existing
exit
exp
expected
expired
explanation
export
exposures
extends
extension
external
factor
failed
faint
fallback
feedback
file
fill
filled
filters
final
find
finish
finishing
first
flashcard
flashcards
flight
flip
flipped
flutter
font
fonts
for
foundation
freeze
from
front
fully
future
game
gamification
gems
gender
generate
generated
geometry
get
goal
gold
good
grade
grader
grammar
green
greeting
grid
group
hard
has
hash
header
heart
hearts
height
hero
highlight
hint
history
home
http
icon
identifier
ids
idx
ignoring
image
immutable
incorrect
increment
independent
index
indexes
indicator
info
init
initial
initialization
initialized
ink
input
insert
insertable
insertion
insets
install
installation
installations
installed
instance
int
integrity
interval
intervals
intro
introduced
introducible
invalid
ipa
issue
issues
item
items
iterable
json
just
key
keys
kind
label
labels
language
last
latency
latest
league
learner
learning
least
ledger
left
lemma
length
lerp
lesson
lessons
letter
lettered
level
levenshtein
lifecycle
light
limit
line
lines
link
list
listen
listening
live
llm
load
loaded
loading
local
locale
locked
log
logger
logging
long
longest
loop
main
managed
manager
managers
manifest
manual
map
mapper
mark
mastery
match
matched
matches
matching
material
math
max
maybe
meets
merge
message
messages
met
meta
mic
migrate
migration
min
mini
minor
minutes
missing
mistake
mistakes
mixin
mock
mode
model
morphology
multiple
muted
name
native
natural
needed
needleman
neural
new
next
non
normalize
normalizer
not
notes
notifier
novel
null
nullable
object
observation
observations
observed
observer
offline
onboarding
one
open
operation
operator
option
optional
options
orange
orchestrator
order
orderings
original
other
outcome
output
over
overall
override
pack
package
packs
padding
page
paint
painter
pair
palatalized
parse
part
partial
pass
passed
passing
password
path
paths
pattern
payload
pending
per
persist
phase
phoneme
phonemes
phrases
picker
pill
placement
plan
play
played
player
plus
points
policy
port
ports
practice
preferences
prefs
prep
preposition
prerequisites
presentation
pressed
preview
previous
pri
primary
priority
privacy
probability
problem
process
processing
production
profile
profiles
progress
prompt
prompted
pronunciation
provider
providers
provisional
public
pull
purple
push
question
questions
queue
quick
radius
random
rate
rating
raw
read
reading
ready
real
reason
record
recorded
recorder
recording
recovery
red
reestimate
ref
reference
refill
refresh
refs
reg
regen
register
release
reload
remaining
remote
repaint
repair
repaired
replace
replays
replies
reply
repo
repositories
repository
reps
request
require
required
reset
response
restart
restore
result
results
retention
retire
retry
return
reveal
revealed
review
reviewed
revision
reward
right
ring
rings
riverpod
role
rollback
rollover
route
router
routes
row
rowid
rows
rule
rules
run
safe
said
sample
save
saving
scaffold
scenario
schedule
scheduler
scheduling
schema
scheme
scope
scoped
score
scored
scorer
scores
screen
screens
scroll
search
seconds
section
sections
secure
seed
seeded
seeder
seeds
select
selected
send
sense
sentence
sequence
serialized
service
services
session
set
settings
severity
shadow
share
shared
sheets
shortcut
should
show
shuffle
side
sign
signed
similarity
single
size
skill
skills
skipped
slots
slow
slug
snapshot
soft
sound
sounds
source
speak
speaking
speech
spelling
spoken
srs
stability
stage
start
started
starting
startup
stat
state
stateful
stateless
static
stats
status
step
steps
stop
storage
stored
strategy
streak
stream
string
strip
stt
style
stylistic
sub
submit
submitted
subscription
subtitle
success
suggested
supabase
support
supported
supports
switch
sync
synthesis
synthesize
table
tables
tags
taken
tap
target
task
tasks
teach
teaching
text
theme
threshold
ticker
tile
time
timer
tint
tip
title
today
toggle
tokens
total
track
tracker
trailing
transcribe
transcribed
transcriber
transcript
transcription
transfer
transfers
transition
translation
trigger
true
try
tts
tutor
txt
type
typed
typedef
types
typing
union
unique
unit
units
unlocked
unresolved
unsuccessful
update
updated
upsert
url
usable
used
user
uses
utils
uuid
valid
validate
validated
validator
value
values
verification
verified
verifier
verify
version
view
viewport
violet
vocab
vocabulary
voice
voices
void
vowel
vowels
was
watch
weight
welcome
whisper
widget
widgets
with
without
word
words
write
writing
wrong
wunsch